espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/mipi_dsi_host_eco5_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Version Register */
/** Type of version register
 *  NA
 */
typedef union {
    struct {
        /** version : RO; bitpos: [31:0]; default: 825504042;
         *  NA
         */
        uint32_t version:32;
    };
    uint32_t val;
} dsi_host_version_reg_t;


/** Group: Configuration Registers */
/** Type of pwr_up register
 *  NA
 */
typedef union {
    struct {
        /** shutdownz : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t shutdownz:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} dsi_host_pwr_up_reg_t;

/** Type of clkmgr_cfg register
 *  NA
 */
typedef union {
    struct {
        /** tx_esc_clk_division : R/W; bitpos: [7:0]; default: 0;
         *  NA
         */
        uint32_t tx_esc_clk_division:8;
        /** to_clk_division : R/W; bitpos: [15:8]; default: 0;
         *  NA
         */
        uint32_t to_clk_division:8;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} dsi_host_clkmgr_cfg_reg_t;

/** Type of dpi_vcid register
 *  NA
 */
typedef union {
    struct {
        /** dpi_vcid : R/W; bitpos: [1:0]; default: 0;
         *  NA
         */
        uint32_t dpi_vcid:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} dsi_host_dpi_vcid_reg_t;

/** Type of dpi_color_coding register
 *  NA
 */
typedef union {
    struct {
        /** dpi_color_coding : R/W; bitpos: [3:0]; default: 0;
         *  NA
         */
        uint32_t dpi_color_coding:4;
        uint32_t reserved_4:4;
        /** loosely18_en : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t loosely18_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} dsi_host_dpi_color_coding_reg_t;

/** Type of dpi_cfg_pol register
 *  NA
 */
typedef union {
    struct {
        /** dataen_active_low : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t dataen_active_low:1;
        /** vsync_active_low : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t vsync_active_low:1;
        /** hsync_active_low : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t hsync_active_low:1;
        /** shutd_active_low : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t shutd_active_low:1;
        /** colorm_active_low : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t colorm_active_low:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} dsi_host_dpi_cfg_pol_reg_t;

/** Type of dpi_lp_cmd_tim register
 *  NA
 */
typedef union {
    struct {
        /** invact_lpcmd_time : R/W; bitpos: [7:0]; default: 0;
         *  NA
         */
        uint32_t invact_lpcmd_time:8;
        uint32_t reserved_8:8;
        /** outvact_lpcmd_time : R/W; bitpos: [23:16]; default: 0;
         *  NA
         */
        uint32_t outvact_lpcmd_time:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} dsi_host_dpi_lp_cmd_tim_reg_t;

/** Type of dbi_vcid register
 *  NA
 */
typedef union {
    struct {
        /** dbi_vcid : R/W; bitpos: [1:0]; default: 0;
         *  NA
         */
        uint32_t dbi_vcid:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} dsi_host_dbi_vcid_reg_t;

/** Type of dbi_cfg register
 *  NA
 */
typedef union {
    struct {
        /** in_dbi_conf : R/W; bitpos: [3:0]; default: 0;
         *  NA
         */
        uint32_t in_dbi_conf:4;
        uint32_t reserved_4:4;
        /** out_dbi_conf : R/W; bitpos: [11:8]; default: 0;
         *  NA
         */
        uint32_t out_dbi_conf:4;
        uint32_t reserved_12:4;
        /** lut_size_conf : R/W; bitpos: [17:16]; default: 0;
         *  NA
         */
        uint32_t lut_size_conf:2;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} dsi_host_dbi_cfg_reg_t;

/** Type of dbi_partitioning_en register
 *  NA
 */
typedef union {
    struct {
        /** partitioning_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t partitioning_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} dsi_host_dbi_partitioning_en_reg_t;

/** Type of dbi_cmdsize register
 *  NA
 */
typedef union {
    struct {
        /** wr_cmd_size : R/W; bitpos: [15:0]; default: 0;
         *  NA
         */
        uint32_t wr_cmd_size:16;
        /** allowed_cmd_size : R/W; bitpos: [31:16]; default: 0;
         *  NA
         */
        uint32_t allowed_cmd_size:16;
    };
    uint32_t val;
} dsi_host_dbi_cmdsize_reg_t;

/** Type of pckhdl_cfg register
 *  NA
 */
typedef union {
    struct {
        /** eotp_tx_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t eotp_tx_en:1;
        /** eotp_rx_en : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t eotp_rx_en:1;
        /** bta_en : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t bta_en:1;
        /** ecc_rx_en : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ecc_rx_en:1;
        /** crc_rx_en : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t crc_rx_en:1;
        /** eotp_tx_lp_en : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t eotp_tx_lp_en:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} dsi_host_pckhdl_cfg_reg_t;

/** Type of gen_vcid register
 *  NA
 */
typedef union {
    struct {
        /** gen_vcid_rx : R/W; bitpos: [1:0]; default: 0;
         *  NA
         */
        uint32_t gen_vcid_rx:2;
        uint32_t reserved_2:6;
        /** gen_vcid_tear_auto : R/W; bitpos: [9:8]; default: 0;
         *  NA
         */
        uint32_t gen_vcid_tear_auto:2;
        uint32_t reserved_10:6;
        /** gen_vcid_tx_auto : R/W; bitpos: [17:16]; default: 0;
         *  NA
         */
        uint32_t gen_vcid_tx_auto:2;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} dsi_host_gen_vcid_reg_t;

/** Type of mode_cfg register
 *  NA
 */
typedef union {
    struct {
        /** cmd_video_mode : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t cmd_video_mode:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} dsi_host_mode_cfg_reg_t;

/** Type of vid_mode_cfg register
 *  NA
 */
typedef union {
    struct {
        /** vid_mode_type : R/W; bitpos: [1:0]; default: 0;
         *  NA
         */
        uint32_t vid_mode_type:2;
        uint32_t reserved_2:6;
        /** lp_vsa_en : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t lp_vsa_en:1;
        /** lp_vbp_en : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t lp_vbp_en:1;
        /** lp_vfp_en : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t lp_vfp_en:1;
        /** lp_vact_en : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t lp_vact_en:1;
        /** lp_hbp_en : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t lp_hbp_en:1;
        /** lp_hfp_en : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t lp_hfp_en:1;
        /** frame_bta_ack_en : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t frame_bta_ack_en:1;
        /** lp_cmd_en : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t lp_cmd_en:1;
        /** vpg_en : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t vpg_en:1;
        uint32_t reserved_17:3;
        /** vpg_mode : R/W; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t vpg_mode:1;
        uint32_t reserved_21:3;
        /** vpg_orientation : R/W; bitpos: [24]; default: 0;
         *  NA
         */
        uint32_t vpg_orientation:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} dsi_host_vid_mode_cfg_reg_t;

/** Type of vid_pkt_size register
 *  NA
 */
typedef union {
    struct {
        /** vid_pkt_size : R/W; bitpos: [13:0]; default: 0;
         *  NA
         */
        uint32_t vid_pkt_size:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dsi_host_vid_pkt_size_reg_t;

/** Type of vid_num_chunks register
 *  NA
 */
typedef union {
    struct {
        /** vid_num_chunks : R/W; bitpos: [12:0]; default: 0;
         *  NA
         */
        uint32_t vid_num_chunks:13;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dsi_host_vid_num_chunks_reg_t;

/** Type of vid_null_size register
 *  NA
 */
typedef union {
    struct {
        /** vid_null_size : R/W; bitpos: [12:0]; default: 0;
         *  NA
         */
        uint32_t vid_null_size:13;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dsi_host_vid_null_size_reg_t;

/** Type of vid_hsa_time register
 *  NA
 */
typedef union {
    struct {
        /** vid_hsa_time : R/W; bitpos: [11:0]; default: 0;
         *  NA
         */
        uint32_t vid_hsa_time:12;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} dsi_host_vid_hsa_time_reg_t;

/** Type of vid_hbp_time register
 *  NA
 */
typedef union {
    struct {
        /** vid_hbp_time : R/W; bitpos: [11:0]; default: 0;
         *  NA
         */
        uint32_t vid_hbp_time:12;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} dsi_host_vid_hbp_time_reg_t;

