espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/mipi_dsi_host_eco5_struct.h
/** Type of vid_hline_time register
 *  NA
 */
typedef union {
    struct {
        /** vid_hline_time : R/W; bitpos: [14:0]; default: 0;
         *  NA
         */
        uint32_t vid_hline_time:15;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} dsi_host_vid_hline_time_reg_t;

/** Type of vid_vsa_lines register
 *  NA
 */
typedef union {
    struct {
        /** vsa_lines : R/W; bitpos: [9:0]; default: 0;
         *  NA
         */
        uint32_t vsa_lines:10;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} dsi_host_vid_vsa_lines_reg_t;

/** Type of vid_vbp_lines register
 *  NA
 */
typedef union {
    struct {
        /** vbp_lines : R/W; bitpos: [9:0]; default: 0;
         *  NA
         */
        uint32_t vbp_lines:10;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} dsi_host_vid_vbp_lines_reg_t;

/** Type of vid_vfp_lines register
 *  NA
 */
typedef union {
    struct {
        /** vfp_lines : R/W; bitpos: [9:0]; default: 0;
         *  NA
         */
        uint32_t vfp_lines:10;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} dsi_host_vid_vfp_lines_reg_t;

/** Type of vid_vactive_lines register
 *  NA
 */
typedef union {
    struct {
        /** v_active_lines : R/W; bitpos: [13:0]; default: 0;
         *  NA
         */
        uint32_t v_active_lines:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dsi_host_vid_vactive_lines_reg_t;

/** Type of edpi_cmd_size register
 *  NA
 */
typedef union {
    struct {
        /** edpi_allowed_cmd_size : R/W; bitpos: [15:0]; default: 0;
         *  NA
         */
        uint32_t edpi_allowed_cmd_size:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} dsi_host_edpi_cmd_size_reg_t;

/** Type of cmd_mode_cfg register
 *  NA
 */
typedef union {
    struct {
        /** tear_fx_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t tear_fx_en:1;
        /** ack_rqst_en : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ack_rqst_en:1;
        uint32_t reserved_2:6;
        /** gen_sw_0p_tx : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t gen_sw_0p_tx:1;
        /** gen_sw_1p_tx : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t gen_sw_1p_tx:1;
        /** gen_sw_2p_tx : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t gen_sw_2p_tx:1;
        /** gen_sr_0p_tx : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t gen_sr_0p_tx:1;
        /** gen_sr_1p_tx : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t gen_sr_1p_tx:1;
        /** gen_sr_2p_tx : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t gen_sr_2p_tx:1;
        /** gen_lw_tx : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t gen_lw_tx:1;
        uint32_t reserved_15:1;
        /** dcs_sw_0p_tx : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t dcs_sw_0p_tx:1;
        /** dcs_sw_1p_tx : R/W; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t dcs_sw_1p_tx:1;
        /** dcs_sr_0p_tx : R/W; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t dcs_sr_0p_tx:1;
        /** dcs_lw_tx : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t dcs_lw_tx:1;
        uint32_t reserved_20:4;
        /** max_rd_pkt_size : R/W; bitpos: [24]; default: 0;
         *  NA
         */
        uint32_t max_rd_pkt_size:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} dsi_host_cmd_mode_cfg_reg_t;

/** Type of gen_hdr register
 *  NA
 */
typedef union {
    struct {
        /** gen_dt : R/W; bitpos: [5:0]; default: 0;
         *  NA
         */
        uint32_t gen_dt:6;
        /** gen_vc : R/W; bitpos: [7:6]; default: 0;
         *  NA
         */
        uint32_t gen_vc:2;
        /** gen_wc_lsbyte : R/W; bitpos: [15:8]; default: 0;
         *  NA
         */
        uint32_t gen_wc_lsbyte:8;
        /** gen_wc_msbyte : R/W; bitpos: [23:16]; default: 0;
         *  NA
         */
        uint32_t gen_wc_msbyte:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} dsi_host_gen_hdr_reg_t;

/** Type of gen_pld_data register
 *  NA
 */
typedef union {
    struct {
        /** gen_pld_b1 : R/W; bitpos: [7:0]; default: 0;
         *  NA
         */
        uint32_t gen_pld_b1:8;
        /** gen_pld_b2 : R/W; bitpos: [15:8]; default: 0;
         *  NA
         */
        uint32_t gen_pld_b2:8;
        /** gen_pld_b3 : R/W; bitpos: [23:16]; default: 0;
         *  NA
         */
        uint32_t gen_pld_b3:8;
        /** gen_pld_b4 : R/W; bitpos: [31:24]; default: 0;
         *  NA
         */
        uint32_t gen_pld_b4:8;
    };
    uint32_t val;
} dsi_host_gen_pld_data_reg_t;

/** Type of to_cnt_cfg register
 *  NA
 */
typedef union {
    struct {
        /** lprx_to_cnt : R/W; bitpos: [15:0]; default: 0;
         *  NA
         */
        uint32_t lprx_to_cnt:16;
        /** hstx_to_cnt : R/W; bitpos: [31:16]; default: 0;
         *  NA
         */
        uint32_t hstx_to_cnt:16;
    };
    uint32_t val;
} dsi_host_to_cnt_cfg_reg_t;

/** Type of hs_rd_to_cnt register
 *  NA
 */
typedef union {
    struct {
        /** hs_rd_to_cnt : R/W; bitpos: [15:0]; default: 0;
         *  NA
         */
        uint32_t hs_rd_to_cnt:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} dsi_host_hs_rd_to_cnt_reg_t;

/** Type of lp_rd_to_cnt register
 *  NA
 */
typedef union {
    struct {
        /** lp_rd_to_cnt : R/W; bitpos: [15:0]; default: 0;
         *  NA
         */
        uint32_t lp_rd_to_cnt:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} dsi_host_lp_rd_to_cnt_reg_t;

/** Type of hs_wr_to_cnt register
 *  NA
 */
typedef union {
    struct {
        /** hs_wr_to_cnt : R/W; bitpos: [15:0]; default: 0;
         *  NA
         */
        uint32_t hs_wr_to_cnt:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} dsi_host_hs_wr_to_cnt_reg_t;

