espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/mipi_dsi_host_eco5_struct.h
/** Type of lp_wr_to_cnt register
 *  NA
 */
typedef union {
    struct {
        /** lp_wr_to_cnt : R/W; bitpos: [15:0]; default: 0;
         *  NA
         */
        uint32_t lp_wr_to_cnt:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} dsi_host_lp_wr_to_cnt_reg_t;

/** Type of bta_to_cnt register
 *  NA
 */
typedef union {
    struct {
        /** bta_to_cnt : R/W; bitpos: [15:0]; default: 0;
         *  NA
         */
        uint32_t bta_to_cnt:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} dsi_host_bta_to_cnt_reg_t;

/** Type of sdf_3d register
 *  NA
 */
typedef union {
    struct {
        /** mode_3d : R/W; bitpos: [1:0]; default: 0;
         *  NA
         */
        uint32_t mode_3d:2;
        /** format_3d : R/W; bitpos: [3:2]; default: 0;
         *  NA
         */
        uint32_t format_3d:2;
        /** second_vsync : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t second_vsync:1;
        /** right_first : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t right_first:1;
        uint32_t reserved_6:10;
        /** send_3d_cfg : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t send_3d_cfg:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} dsi_host_sdf_3d_reg_t;

/** Type of lpclk_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** phy_txrequestclkhs : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t phy_txrequestclkhs:1;
        /** auto_clklane_ctrl : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t auto_clklane_ctrl:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} dsi_host_lpclk_ctrl_reg_t;

/** Type of phy_tmr_lpclk_cfg register
 *  NA
 */
typedef union {
    struct {
        /** phy_clklp2hs_time : R/W; bitpos: [9:0]; default: 0;
         *  NA
         */
        uint32_t phy_clklp2hs_time:10;
        uint32_t reserved_10:6;
        /** phy_clkhs2lp_time : R/W; bitpos: [25:16]; default: 0;
         *  NA
         */
        uint32_t phy_clkhs2lp_time:10;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} dsi_host_phy_tmr_lpclk_cfg_reg_t;

/** Type of phy_tmr_cfg register
 *  NA
 */
typedef union {
    struct {
        /** phy_lp2hs_time : R/W; bitpos: [9:0]; default: 0;
         *  NA
         */
        uint32_t phy_lp2hs_time:10;
        uint32_t reserved_10:6;
        /** phy_hs2lp_time : R/W; bitpos: [25:16]; default: 0;
         *  NA
         */
        uint32_t phy_hs2lp_time:10;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} dsi_host_phy_tmr_cfg_reg_t;

/** Type of phy_rstz register
 *  NA
 */
typedef union {
    struct {
        /** phy_shutdownz : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t phy_shutdownz:1;
        /** phy_rstz : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t phy_rstz:1;
        /** phy_enableclk : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t phy_enableclk:1;
        /** phy_forcepll : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t phy_forcepll:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dsi_host_phy_rstz_reg_t;

/** Type of phy_if_cfg register
 *  NA
 */
typedef union {
    struct {
        /** n_lanes : R/W; bitpos: [1:0]; default: 1;
         *  NA
         */
        uint32_t n_lanes:2;
        uint32_t reserved_2:6;
        /** phy_stop_wait_time : R/W; bitpos: [15:8]; default: 0;
         *  NA
         */
        uint32_t phy_stop_wait_time:8;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} dsi_host_phy_if_cfg_reg_t;

/** Type of phy_ulps_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** phy_txrequlpsclk : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t phy_txrequlpsclk:1;
        /** phy_txexitulpsclk : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t phy_txexitulpsclk:1;
        /** phy_txrequlpslan : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t phy_txrequlpslan:1;
        /** phy_txexitulpslan : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t phy_txexitulpslan:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dsi_host_phy_ulps_ctrl_reg_t;

/** Type of phy_tx_triggers register
 *  NA
 */
typedef union {
    struct {
        /** phy_tx_triggers : R/W; bitpos: [3:0]; default: 0;
         *  NA
         */
        uint32_t phy_tx_triggers:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dsi_host_phy_tx_triggers_reg_t;

/** Type of phy_tst_ctrl0 register
 *  NA
 */
typedef union {
    struct {
        /** phy_testclr : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t phy_testclr:1;
        /** phy_testclk : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t phy_testclk:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} dsi_host_phy_tst_ctrl0_reg_t;

/** Type of phy_tst_ctrl1 register
 *  NA
 */
typedef union {
    struct {
        /** phy_testdin : R/W; bitpos: [7:0]; default: 0;
         *  NA
         */
        uint32_t phy_testdin:8;
        /** pht_testdout : RO; bitpos: [15:8]; default: 0;
         *  NA
         */
        uint32_t pht_testdout:8;
        /** phy_testen : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t phy_testen:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} dsi_host_phy_tst_ctrl1_reg_t;

/** Type of phy_cal register
 *  NA
 */
typedef union {
    struct {
        /** txskewcalhs : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t txskewcalhs:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} dsi_host_phy_cal_reg_t;

/** Type of dsc_parameter register
 *  NA
 */
typedef union {
    struct {
        /** compression_mode : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t compression_mode:1;
        uint32_t reserved_1:7;
        /** compress_algo : R/W; bitpos: [9:8]; default: 0;
         *  NA
         */
        uint32_t compress_algo:2;
        uint32_t reserved_10:6;
        /** pps_sel : R/W; bitpos: [17:16]; default: 0;
         *  NA
         */
        uint32_t pps_sel:2;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} dsi_host_dsc_parameter_reg_t;

/** Type of phy_tmr_rd_cfg register
 *  NA
 */
typedef union {
    struct {
        /** max_rd_time : R/W; bitpos: [14:0]; default: 0;
         *  NA
         */
        uint32_t max_rd_time:15;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} dsi_host_phy_tmr_rd_cfg_reg_t;

/** Type of vid_shadow_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** vid_shadow_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t vid_shadow_en:1;
        uint32_t reserved_1:7;
        /** vid_shadow_req : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t vid_shadow_req:1;
        uint32_t reserved_9:7;
        /** vid_shadow_pin_req : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t vid_shadow_pin_req:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} dsi_host_vid_shadow_ctrl_reg_t;

/** Type of edpi_te_hw_cfg register
 *  NA
 */
typedef union {
    struct {
        /** hw_tear_effect_on : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t hw_tear_effect_on:1;
        /** hw_tear_effect_gen : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t hw_tear_effect_gen:1;
        uint32_t reserved_2:2;
        /** hw_set_scan_line : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t hw_set_scan_line:1;
        uint32_t reserved_5:11;
        /** scan_line_parameter : R/W; bitpos: [31:16]; default: 0;
         *  NA
         */
        uint32_t scan_line_parameter:16;
    };
    uint32_t val;
} dsi_host_edpi_te_hw_cfg_reg_t;


/** Group: Status Registers */
/** Type of cmd_pkt_status register
 *  NA
 */
typedef union {
    struct {
        /** gen_cmd_empty : RO; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t gen_cmd_empty:1;
        /** gen_cmd_full : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t gen_cmd_full:1;
        /** gen_pld_w_empty : RO; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t gen_pld_w_empty:1;
        /** gen_pld_w_full : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t gen_pld_w_full:1;
        /** gen_pld_r_empty : RO; bitpos: [4]; default: 1;
         *  NA
         */
        uint32_t gen_pld_r_empty:1;
        /** gen_pld_r_full : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t gen_pld_r_full:1;
        /** gen_rd_cmd_busy : RO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t gen_rd_cmd_busy:1;
        uint32_t reserved_7:9;
        /** gen_buff_cmd_empty : RO; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t gen_buff_cmd_empty:1;
        /** gen_buff_cmd_full : RO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t gen_buff_cmd_full:1;
        /** gen_buff_pld_empty : RO; bitpos: [18]; default: 1;
         *  NA
         */
        uint32_t gen_buff_pld_empty:1;
        /** gen_buff_pld_full : RO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t gen_buff_pld_full:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} dsi_host_cmd_pkt_status_reg_t;

/** Type of phy_status register
 *  NA
 */
typedef union {
    struct {
        /** phy_lock : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t phy_lock:1;
        /** phy_direction : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t phy_direction:1;
        /** phy_stopstateclklane : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t phy_stopstateclklane:1;
        /** phy_ulpsactivenotclk : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t phy_ulpsactivenotclk:1;
        /** phy_stopstate0lane : RO; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t phy_stopstate0lane:1;
        /** phy_ulpsactivenot0lane : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t phy_ulpsactivenot0lane:1;
        /** phy_rxulpsesc0lane : RO; bitpos: [6]; default: 1;
         *  NA
         */
        uint32_t phy_rxulpsesc0lane:1;
        /** phy_stopstate1lane : RO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t phy_stopstate1lane:1;
        /** phy_ulpsactivenot1lane : RO; bitpos: [8]; default: 1;
         *  NA
         */
        uint32_t phy_ulpsactivenot1lane:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} dsi_host_phy_status_reg_t;

/** Type of dpi_vcid_act register
 *  NA
 */
typedef union {
    struct {
        /** dpi_vcid_act : RO; bitpos: [1:0]; default: 0;
         *  NA
         */
        uint32_t dpi_vcid_act:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} dsi_host_dpi_vcid_act_reg_t;

/** Type of dpi_color_coding_act register
 *  NA
 */
typedef union {
    struct {
        /** dpi_color_coding_act : RO; bitpos: [3:0]; default: 0;
         *  NA
         */
        uint32_t dpi_color_coding_act:4;
        uint32_t reserved_4:4;
        /** loosely18_en_act : RO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t loosely18_en_act:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} dsi_host_dpi_color_coding_act_reg_t;

