espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/mipi_dsi_host_eco5_struct.h
/** Type of dpi_lp_cmd_tim_act register
 *  NA
 */
typedef union {
    struct {
        /** invact_lpcmd_time_act : RO; bitpos: [7:0]; default: 0;
         *  NA
         */
        uint32_t invact_lpcmd_time_act:8;
        uint32_t reserved_8:8;
        /** outvact_lpcmd_time_act : RO; bitpos: [23:16]; default: 0;
         *  NA
         */
        uint32_t outvact_lpcmd_time_act:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} dsi_host_dpi_lp_cmd_tim_act_reg_t;

/** Type of vid_mode_cfg_act register
 *  NA
 */
typedef union {
    struct {
        /** vid_mode_type_act : RO; bitpos: [1:0]; default: 0;
         *  NA
         */
        uint32_t vid_mode_type_act:2;
        /** lp_vsa_en_act : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t lp_vsa_en_act:1;
        /** lp_vbp_en_act : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t lp_vbp_en_act:1;
        /** lp_vfp_en_act : RO; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t lp_vfp_en_act:1;
        /** lp_vact_en_act : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t lp_vact_en_act:1;
        /** lp_hbp_en_act : RO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t lp_hbp_en_act:1;
        /** lp_hfp_en_act : RO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t lp_hfp_en_act:1;
        /** frame_bta_ack_en_act : RO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t frame_bta_ack_en_act:1;
        /** lp_cmd_en_act : RO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t lp_cmd_en_act:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} dsi_host_vid_mode_cfg_act_reg_t;

/** Type of vid_pkt_size_act register
 *  NA
 */
typedef union {
    struct {
        /** vid_pkt_size_act : RO; bitpos: [13:0]; default: 0;
         *  NA
         */
        uint32_t vid_pkt_size_act:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dsi_host_vid_pkt_size_act_reg_t;

/** Type of vid_num_chunks_act register
 *  NA
 */
typedef union {
    struct {
        /** vid_num_chunks_act : RO; bitpos: [12:0]; default: 0;
         *  NA
         */
        uint32_t vid_num_chunks_act:13;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dsi_host_vid_num_chunks_act_reg_t;

/** Type of vid_null_size_act register
 *  NA
 */
typedef union {
    struct {
        /** vid_null_size_act : RO; bitpos: [12:0]; default: 0;
         *  NA
         */
        uint32_t vid_null_size_act:13;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dsi_host_vid_null_size_act_reg_t;

/** Type of vid_hsa_time_act register
 *  NA
 */
typedef union {
    struct {
        /** vid_hsa_time_act : RO; bitpos: [11:0]; default: 0;
         *  NA
         */
        uint32_t vid_hsa_time_act:12;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} dsi_host_vid_hsa_time_act_reg_t;

/** Type of vid_hbp_time_act register
 *  NA
 */
typedef union {
    struct {
        /** vid_hbp_time_act : RO; bitpos: [11:0]; default: 0;
         *  NA
         */
        uint32_t vid_hbp_time_act:12;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} dsi_host_vid_hbp_time_act_reg_t;

/** Type of vid_hline_time_act register
 *  NA
 */
typedef union {
    struct {
        /** vid_hline_time_act : RO; bitpos: [14:0]; default: 0;
         *  NA
         */
        uint32_t vid_hline_time_act:15;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} dsi_host_vid_hline_time_act_reg_t;

/** Type of vid_vsa_lines_act register
 *  NA
 */
typedef union {
    struct {
        /** vsa_lines_act : RO; bitpos: [9:0]; default: 0;
         *  NA
         */
        uint32_t vsa_lines_act:10;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} dsi_host_vid_vsa_lines_act_reg_t;

/** Type of vid_vbp_lines_act register
 *  NA
 */
typedef union {
    struct {
        /** vbp_lines_act : RO; bitpos: [9:0]; default: 0;
         *  NA
         */
        uint32_t vbp_lines_act:10;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} dsi_host_vid_vbp_lines_act_reg_t;

/** Type of vid_vfp_lines_act register
 *  NA
 */
typedef union {
    struct {
        /** vfp_lines_act : RO; bitpos: [9:0]; default: 0;
         *  NA
         */
        uint32_t vfp_lines_act:10;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} dsi_host_vid_vfp_lines_act_reg_t;

/** Type of vid_vactive_lines_act register
 *  NA
 */
typedef union {
    struct {
        /** v_active_lines_act : RO; bitpos: [13:0]; default: 0;
         *  NA
         */
        uint32_t v_active_lines_act:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dsi_host_vid_vactive_lines_act_reg_t;

/** Type of vid_pkt_status register
 *  NA
 */
typedef union {
    struct {
        /** dpi_cmd_w_empty : RO; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t dpi_cmd_w_empty:1;
        /** dpi_cmd_w_full : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t dpi_cmd_w_full:1;
        /** dpi_pld_w_empty : RO; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t dpi_pld_w_empty:1;
        /** dpi_pld_w_full : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t dpi_pld_w_full:1;
        uint32_t reserved_4:12;
        /** dpi_buff_pld_empty : RO; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t dpi_buff_pld_empty:1;
        /** dpi_buff_pld_full : RO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t dpi_buff_pld_full:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} dsi_host_vid_pkt_status_reg_t;

/** Type of sdf_3d_act register
 *  NA
 */
typedef union {
    struct {
        /** mode_3d_act : RO; bitpos: [1:0]; default: 0;
         *  NA
         */
        uint32_t mode_3d_act:2;
        /** format_3d_act : RO; bitpos: [3:2]; default: 0;
         *  NA
         */
        uint32_t format_3d_act:2;
        /** second_vsync_act : RO; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t second_vsync_act:1;
        /** right_first_act : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t right_first_act:1;
        uint32_t reserved_6:10;
        /** send_3d_cfg_act : RO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t send_3d_cfg_act:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} dsi_host_sdf_3d_act_reg_t;


/** Group: Interrupt Registers */
/** Type of int_st0 register
 *  NA
 */
typedef union {
    struct {
        /** ack_with_err_0 : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_0:1;
        /** ack_with_err_1 : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_1:1;
        /** ack_with_err_2 : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_2:1;
        /** ack_with_err_3 : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_3:1;
        /** ack_with_err_4 : RO; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_4:1;
        /** ack_with_err_5 : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_5:1;
        /** ack_with_err_6 : RO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_6:1;
        /** ack_with_err_7 : RO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_7:1;
        /** ack_with_err_8 : RO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_8:1;
        /** ack_with_err_9 : RO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_9:1;
        /** ack_with_err_10 : RO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_10:1;
        /** ack_with_err_11 : RO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_11:1;
        /** ack_with_err_12 : RO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_12:1;
        /** ack_with_err_13 : RO; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_13:1;
        /** ack_with_err_14 : RO; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_14:1;
        /** ack_with_err_15 : RO; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t ack_with_err_15:1;
        /** dphy_errors_0 : RO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t dphy_errors_0:1;
        /** dphy_errors_1 : RO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t dphy_errors_1:1;
        /** dphy_errors_2 : RO; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t dphy_errors_2:1;
        /** dphy_errors_3 : RO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t dphy_errors_3:1;
        /** dphy_errors_4 : RO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t dphy_errors_4:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dsi_host_int_st0_reg_t;

