espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/mipi_dsi_host_eco5_struct.h
/** Type of int_st1 register
 *  NA
 */
typedef union {
    struct {
        /** to_hs_tx : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t to_hs_tx:1;
        /** to_lp_rx : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t to_lp_rx:1;
        /** ecc_single_err : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ecc_single_err:1;
        /** ecc_milti_err : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ecc_milti_err:1;
        /** crc_err : RO; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t crc_err:1;
        /** pkt_size_err : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t pkt_size_err:1;
        /** eopt_err : RO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t eopt_err:1;
        /** dpi_pld_wr_err : RO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t dpi_pld_wr_err:1;
        /** gen_cmd_wr_err : RO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t gen_cmd_wr_err:1;
        /** gen_pld_wr_err : RO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t gen_pld_wr_err:1;
        /** gen_pld_send_err : RO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t gen_pld_send_err:1;
        /** gen_pld_rd_err : RO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t gen_pld_rd_err:1;
        /** gen_pld_recev_err : RO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t gen_pld_recev_err:1;
        uint32_t reserved_13:6;
        /** dpi_buff_pld_under : RO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t dpi_buff_pld_under:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} dsi_host_int_st1_reg_t;

/** Type of int_msk0 register
 *  NA
 */
typedef union {
    struct {
        /** mask_ack_with_err_0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_0:1;
        /** mask_ack_with_err_1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_1:1;
        /** mask_ack_with_err_2 : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_2:1;
        /** mask_ack_with_err_3 : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_3:1;
        /** mask_ack_with_err_4 : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_4:1;
        /** mask_ack_with_err_5 : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_5:1;
        /** mask_ack_with_err_6 : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_6:1;
        /** mask_ack_with_err_7 : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_7:1;
        /** mask_ack_with_err_8 : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_8:1;
        /** mask_ack_with_err_9 : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_9:1;
        /** mask_ack_with_err_10 : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_10:1;
        /** mask_ack_with_err_11 : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_11:1;
        /** mask_ack_with_err_12 : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_12:1;
        /** mask_ack_with_err_13 : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_13:1;
        /** mask_ack_with_err_14 : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_14:1;
        /** mask_ack_with_err_15 : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_15:1;
        /** mask_dphy_errors_0 : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t mask_dphy_errors_0:1;
        /** mask_dphy_errors_1 : R/W; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t mask_dphy_errors_1:1;
        /** mask_dphy_errors_2 : R/W; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t mask_dphy_errors_2:1;
        /** mask_dphy_errors_3 : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t mask_dphy_errors_3:1;
        /** mask_dphy_errors_4 : R/W; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t mask_dphy_errors_4:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dsi_host_int_msk0_reg_t;

/** Type of int_msk1 register
 *  NA
 */
typedef union {
    struct {
        /** mask_to_hs_tx : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t mask_to_hs_tx:1;
        /** mask_to_lp_rx : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t mask_to_lp_rx:1;
        /** mask_ecc_single_err : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t mask_ecc_single_err:1;
        /** mask_ecc_milti_err : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t mask_ecc_milti_err:1;
        /** mask_crc_err : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t mask_crc_err:1;
        /** mask_pkt_size_err : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t mask_pkt_size_err:1;
        /** mask_eopt_err : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t mask_eopt_err:1;
        /** mask_dpi_pld_wr_err : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t mask_dpi_pld_wr_err:1;
        /** mask_gen_cmd_wr_err : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t mask_gen_cmd_wr_err:1;
        /** mask_gen_pld_wr_err : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t mask_gen_pld_wr_err:1;
        /** mask_gen_pld_send_err : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t mask_gen_pld_send_err:1;
        /** mask_gen_pld_rd_err : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t mask_gen_pld_rd_err:1;
        /** mask_gen_pld_recev_err : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t mask_gen_pld_recev_err:1;
        uint32_t reserved_13:6;
        /** mask_dpi_buff_pld_under : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t mask_dpi_buff_pld_under:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} dsi_host_int_msk1_reg_t;

/** Type of int_force0 register
 *  NA
 */
typedef union {
    struct {
        /** force_ack_with_err_0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_0:1;
        /** force_ack_with_err_1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_1:1;
        /** force_ack_with_err_2 : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_2:1;
        /** force_ack_with_err_3 : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_3:1;
        /** force_ack_with_err_4 : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_4:1;
        /** force_ack_with_err_5 : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_5:1;
        /** force_ack_with_err_6 : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_6:1;
        /** force_ack_with_err_7 : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_7:1;
        /** force_ack_with_err_8 : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_8:1;
        /** force_ack_with_err_9 : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_9:1;
        /** force_ack_with_err_10 : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_10:1;
        /** force_ack_with_err_11 : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_11:1;
        /** force_ack_with_err_12 : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_12:1;
        /** force_ack_with_err_13 : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_13:1;
        /** force_ack_with_err_14 : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_14:1;
        /** force_ack_with_err_15 : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_15:1;
        /** force_dphy_errors_0 : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t force_dphy_errors_0:1;
        /** force_dphy_errors_1 : R/W; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t force_dphy_errors_1:1;
        /** force_dphy_errors_2 : R/W; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t force_dphy_errors_2:1;
        /** force_dphy_errors_3 : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t force_dphy_errors_3:1;
        /** force_dphy_errors_4 : R/W; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t force_dphy_errors_4:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dsi_host_int_force0_reg_t;

/** Type of int_force1 register
 *  NA
 */
typedef union {
    struct {
        /** force_to_hs_tx : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t force_to_hs_tx:1;
        /** force_to_lp_rx : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t force_to_lp_rx:1;
        /** force_ecc_single_err : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t force_ecc_single_err:1;
        /** force_ecc_milti_err : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t force_ecc_milti_err:1;
        /** force_crc_err : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t force_crc_err:1;
        /** force_pkt_size_err : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t force_pkt_size_err:1;
        /** force_eopt_err : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t force_eopt_err:1;
        /** force_dpi_pld_wr_err : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t force_dpi_pld_wr_err:1;
        /** force_gen_cmd_wr_err : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t force_gen_cmd_wr_err:1;
        /** force_gen_pld_wr_err : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t force_gen_pld_wr_err:1;
        /** force_gen_pld_send_err : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t force_gen_pld_send_err:1;
        /** force_gen_pld_rd_err : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t force_gen_pld_rd_err:1;
        /** force_gen_pld_recev_err : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t force_gen_pld_recev_err:1;
        uint32_t reserved_13:6;
        /** force_dpi_buff_pld_under : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t force_dpi_buff_pld_under:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} dsi_host_int_force1_reg_t;


