espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/mipi_dsi_host_eco5_struct.h
typedef struct {
    volatile dsi_host_version_reg_t version;
    volatile dsi_host_pwr_up_reg_t pwr_up;
    volatile dsi_host_clkmgr_cfg_reg_t clkmgr_cfg;
    volatile dsi_host_dpi_vcid_reg_t dpi_vcid;
    volatile dsi_host_dpi_color_coding_reg_t dpi_color_coding;
    volatile dsi_host_dpi_cfg_pol_reg_t dpi_cfg_pol;
    volatile dsi_host_dpi_lp_cmd_tim_reg_t dpi_lp_cmd_tim;
    volatile dsi_host_dbi_vcid_reg_t dbi_vcid;
    volatile dsi_host_dbi_cfg_reg_t dbi_cfg;
    volatile dsi_host_dbi_partitioning_en_reg_t dbi_partitioning_en;
    volatile dsi_host_dbi_cmdsize_reg_t dbi_cmdsize;
    volatile dsi_host_pckhdl_cfg_reg_t pckhdl_cfg;
    volatile dsi_host_gen_vcid_reg_t gen_vcid;
    volatile dsi_host_mode_cfg_reg_t mode_cfg;
    volatile dsi_host_vid_mode_cfg_reg_t vid_mode_cfg;
    volatile dsi_host_vid_pkt_size_reg_t vid_pkt_size;
    volatile dsi_host_vid_num_chunks_reg_t vid_num_chunks;
    volatile dsi_host_vid_null_size_reg_t vid_null_size;
    volatile dsi_host_vid_hsa_time_reg_t vid_hsa_time;
    volatile dsi_host_vid_hbp_time_reg_t vid_hbp_time;
    volatile dsi_host_vid_hline_time_reg_t vid_hline_time;
    volatile dsi_host_vid_vsa_lines_reg_t vid_vsa_lines;
    volatile dsi_host_vid_vbp_lines_reg_t vid_vbp_lines;
    volatile dsi_host_vid_vfp_lines_reg_t vid_vfp_lines;
    volatile dsi_host_vid_vactive_lines_reg_t vid_vactive_lines;
    volatile dsi_host_edpi_cmd_size_reg_t edpi_cmd_size;
    volatile dsi_host_cmd_mode_cfg_reg_t cmd_mode_cfg;
    volatile dsi_host_gen_hdr_reg_t gen_hdr;
    volatile dsi_host_gen_pld_data_reg_t gen_pld_data;
    volatile dsi_host_cmd_pkt_status_reg_t cmd_pkt_status;
    volatile dsi_host_to_cnt_cfg_reg_t to_cnt_cfg;
    volatile dsi_host_hs_rd_to_cnt_reg_t hs_rd_to_cnt;
    volatile dsi_host_lp_rd_to_cnt_reg_t lp_rd_to_cnt;
    volatile dsi_host_hs_wr_to_cnt_reg_t hs_wr_to_cnt;
    volatile dsi_host_lp_wr_to_cnt_reg_t lp_wr_to_cnt;
    volatile dsi_host_bta_to_cnt_reg_t bta_to_cnt;
    volatile dsi_host_sdf_3d_reg_t sdf_3d;
    volatile dsi_host_lpclk_ctrl_reg_t lpclk_ctrl;
    volatile dsi_host_phy_tmr_lpclk_cfg_reg_t phy_tmr_lpclk_cfg;
    volatile dsi_host_phy_tmr_cfg_reg_t phy_tmr_cfg;
    volatile dsi_host_phy_rstz_reg_t phy_rstz;
    volatile dsi_host_phy_if_cfg_reg_t phy_if_cfg;
    volatile dsi_host_phy_ulps_ctrl_reg_t phy_ulps_ctrl;
    volatile dsi_host_phy_tx_triggers_reg_t phy_tx_triggers;
    volatile dsi_host_phy_status_reg_t phy_status;
    volatile dsi_host_phy_tst_ctrl0_reg_t phy_tst_ctrl0;
    volatile dsi_host_phy_tst_ctrl1_reg_t phy_tst_ctrl1;
    volatile dsi_host_int_st0_reg_t int_st0;
    volatile dsi_host_int_st1_reg_t int_st1;
    volatile dsi_host_int_msk0_reg_t int_msk0;
    volatile dsi_host_int_msk1_reg_t int_msk1;
    volatile dsi_host_phy_cal_reg_t phy_cal;
    uint32_t reserved_0d0[2];
    volatile dsi_host_int_force0_reg_t int_force0;
    volatile dsi_host_int_force1_reg_t int_force1;
    uint32_t reserved_0e0[4];
    volatile dsi_host_dsc_parameter_reg_t dsc_parameter;
    volatile dsi_host_phy_tmr_rd_cfg_reg_t phy_tmr_rd_cfg;
    uint32_t reserved_0f8[2];
    volatile dsi_host_vid_shadow_ctrl_reg_t vid_shadow_ctrl;
    uint32_t reserved_104[2];
    volatile dsi_host_dpi_vcid_act_reg_t dpi_vcid_act;
    volatile dsi_host_dpi_color_coding_act_reg_t dpi_color_coding_act;
    uint32_t reserved_114;
    volatile dsi_host_dpi_lp_cmd_tim_act_reg_t dpi_lp_cmd_tim_act;
    volatile dsi_host_edpi_te_hw_cfg_reg_t edpi_te_hw_cfg;
    uint32_t reserved_120[6];
    volatile dsi_host_vid_mode_cfg_act_reg_t vid_mode_cfg_act;
    volatile dsi_host_vid_pkt_size_act_reg_t vid_pkt_size_act;
    volatile dsi_host_vid_num_chunks_act_reg_t vid_num_chunks_act;
    volatile dsi_host_vid_null_size_act_reg_t vid_null_size_act;
    volatile dsi_host_vid_hsa_time_act_reg_t vid_hsa_time_act;
    volatile dsi_host_vid_hbp_time_act_reg_t vid_hbp_time_act;
    volatile dsi_host_vid_hline_time_act_reg_t vid_hline_time_act;
    volatile dsi_host_vid_vsa_lines_act_reg_t vid_vsa_lines_act;
    volatile dsi_host_vid_vbp_lines_act_reg_t vid_vbp_lines_act;
    volatile dsi_host_vid_vfp_lines_act_reg_t vid_vfp_lines_act;
    volatile dsi_host_vid_vactive_lines_act_reg_t vid_vactive_lines_act;
    uint32_t reserved_164;
    volatile dsi_host_vid_pkt_status_reg_t vid_pkt_status;
    uint32_t reserved_16c[9];
    volatile dsi_host_sdf_3d_act_reg_t sdf_3d_act;
} dsi_host_dev_t;

extern dsi_host_dev_t MIPI_DSI_HOST;

#ifndef __cplusplus
_Static_assert(sizeof(dsi_host_dev_t) == 0x194, "Invalid size of dsi_host_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
